cf/DataProcessors/обДоходыРасходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>обДоходыРасходы</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf/AccumulationRegisters/ПоступленияДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ПоступленияДенег</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаДохода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидДоходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/AccumulationRegisters/РасходДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>РасходДенег</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаРасхода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/InformationRegisters/РегулярныеРасходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>РегулярныеРасходы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаРасхода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РегулулярныйРасход</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегулярныйРасход</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/DataProcessors/обДоходыРасходы/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.НачалоПериода = НачалоМесяца(ТекущаяДата());
	Объект.КонецПериода  = КонецДня(КонецМесяца(ТекущаяДата()));
	СформироватьПредставлениеДаты();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере()

	Обработка = РеквизитФормыВЗначение("Объект");	
	
	Макет = Обработка.ПолучитьМакет("Макет");
	
	ТабличныйДокумент.Очистить();
	
	облЗаголовок = Макет.ПолучитьОбласть("ОблЗаголовок");
	облШапка 	 = Макет.ПолучитьОбласть("облШапка");
	облСтрокаПоследняя 	 = Макет.ПолучитьОбласть("облСтрокаПоследняя");
	облИтого 	 = Макет.ПолучитьОбласть("облИтого");	

	облЗаголовок.Параметры.ПериодОтчета = "Доходы/Расходы за: " + Формат(Объект.НачалоПериода,"ДФ=dd.MM.yyyy") + " - " + Формат(Объект.КонецПериода,"ДФ=dd.MM.yyyy");
	ТабличныйДокумент.Вывести(облЗаголовок);
	
	ТабличныйДокумент.Вывести(облШапка);
	
	НачалоПериода = Объект.НачалоПериода;
	КонецПериода  = Объект.КонецПериода;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ПоступленияДенегОбороты.ВидДоходов КАК ВидДоходов,
		|	СУММА(ПоступленияДенегОбороты.СуммаДоходаОборот) КАК СуммаДоходаОборот,
		|	АВТОНОМЕРЗАПИСИ() КАК НПП
		|ПОМЕСТИТЬ ВТ_Доходы
		|ИЗ
		|	РегистрНакопления.ПоступленияДенег.Обороты(&НачалоПериода, &КонецПериода, , ) КАК ПоступленияДенегОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступленияДенегОбороты.ВидДоходов
		|
		|УПОРЯДОЧИТЬ ПО
		|	СУММА(ПоступленияДенегОбороты.СуммаДоходаОборот) УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасходДенегОбороты.СтатьяРасходов КАК СтатьяРасходов,
		|	СУММА(РасходДенегОбороты.СуммаРасходаОборот) КАК СуммаРасходаОборот,
		|	ЛОЖЬ КАК ЭтоРегулярныйРасход
		|ПОМЕСТИТЬ ВТ_Расходы
		|ИЗ
		|	РегистрНакопления.РасходДенег.Обороты(&НачалоПериода, &КонецПериода, , ) КАК РасходДенегОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходДенегОбороты.СтатьяРасходов
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РегулярныеРасходы.РегулулярныйРасход,
		|	РегулярныеРасходы.СуммаРасхода,
		|	ИСТИНА
		|ИЗ
		|	РегистрСведений.РегулярныеРасходы КАК РегулярныеРасходы
		|ГДЕ
		|	НЕ РегулярныеРасходы.РегулулярныйРасход В
		|				(ВЫБРАТЬ
		|					РасходДенегОбороты.РегулярныйРасход КАК РегулярныйРасход
		|				ИЗ
		|					РегистрНакопления.РасходДенег.Обороты(&НачалоПериода, &КонецПериода, , ) КАК РасходДенегОбороты)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ВТ_Расходы.СтатьяРасходов КАК СтатьяРасходов,
		|	СУММА(ВТ_Расходы.СуммаРасходаОборот) КАК СуммаРасходаОборот,
		|	ВТ_Расходы.ЭтоРегулярныйРасход КАК ЭтоРегулярныйРасход,
		|	АВТОНОМЕРЗАПИСИ() КАК НПП
		|ПОМЕСТИТЬ ВТ_РасходыУпорядоченные
		|ИЗ
		|	ВТ_Расходы КАК ВТ_Расходы
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Расходы.СтатьяРасходов,
		|	ВТ_Расходы.ЭтоРегулярныйРасход
		|
		|УПОРЯДОЧИТЬ ПО
		|	СуммаРасходаОборот УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Доходы.ВидДоходов КАК ВидДоходов,
		|	ВТ_Доходы.СуммаДоходаОборот КАК СуммаДоходаОборот,
		|	ВТ_РасходыУпорядоченные.СтатьяРасходов КАК СтатьяРасходов,
		|	ВТ_РасходыУпорядоченные.ЭтоРегулярныйРасход КАК ЭтоРегулярныйРасход,
		|	ВТ_РасходыУпорядоченные.СуммаРасходаОборот КАК СуммаРасходаОборот
		|ИЗ
		|	ВТ_Доходы КАК ВТ_Доходы
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_РасходыУпорядоченные КАК ВТ_РасходыУпорядоченные
		|		ПО ВТ_Доходы.НПП = ВТ_РасходыУпорядоченные.НПП
		|ИТОГИ
		|	СУММА(СуммаДоходаОборот),
		|	СУММА(СуммаРасходаОборот)
		|ПО
		|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаОбщийИтог.Следующий();		// Общий итог
	
	облИтого.Параметры.СуммаД = ВыборкаОбщийИтог.СуммаДоходаОборот;
	облИтого.Параметры.СуммаР = ВыборкаОбщийИтог.СуммаРасходаОборот;
	ТабличныйДокумент.Вывести(облИтого);
	
	ВыборкаДетальныеЗаписи = ВыборкаОбщийИтог.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ЭтоРегулярныйРасход тогда
			облСтрока	 = Макет.ПолучитьОбласть("ОблСтрокаК");
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ВидДоходов) тогда
				облСтрока.Параметры.ВидДохода = ВыборкаДетальныеЗаписи.ВидДоходов;
			Иначе
				облСтрока.Параметры.ВидДохода = "";
			КонецЕсли;			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СуммаДоходаОборот) тогда
				облСтрока.Параметры.СуммаД = ВыборкаДетальныеЗаписи.СуммаДоходаОборот;
			Иначе
				облСтрока.Параметры.СуммаД = "";
			КонецЕсли;			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СтатьяРасходов) тогда
				облСтрока.Параметры.СтатьяРасхода = ВыборкаДетальныеЗаписи.СтатьяРасходов;
			Иначе
				облСтрока.Параметры.СтатьяРасхода = "";
			КонецЕсли;			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СуммаРасходаОборот) тогда
				облСтрока.Параметры.СуммаР = ВыборкаДетальныеЗаписи.СуммаРасходаОборот;
			Иначе
				облСтрока.Параметры.СуммаР = "";
			КонецЕсли;
		ИначеЕсли ВыборкаДетальныеЗаписи.СтатьяРасходов = Справочники.СтатьиРасходов.Инвестиции тогда
			облСтрока	 = Макет.ПолучитьОбласть("ОблСтрокаИ");
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ВидДоходов) тогда
				облСтрока.Параметры.ВидДохода = ВыборкаДетальныеЗаписи.ВидДоходов;
			Иначе
				облСтрока.Параметры.ВидДохода = "";
			КонецЕсли;			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СуммаДоходаОборот) тогда
				облСтрока.Параметры.СуммаД = ВыборкаДетальныеЗаписи.СуммаДоходаОборот;
			Иначе
				облСтрока.Параметры.СуммаД = "";
			КонецЕсли;			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СтатьяРасходов) тогда
				облСтрока.Параметры.СтатьяРасхода = ВыборкаДетальныеЗаписи.СтатьяРасходов;
			Иначе
				облСтрока.Параметры.СтатьяРасхода = "";
			КонецЕсли;			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СуммаРасходаОборот) тогда
				облСтрока.Параметры.СуммаР = ВыборкаДетальныеЗаписи.СуммаРасходаОборот;
			Иначе
				облСтрока.Параметры.СуммаР = "";
			КонецЕсли;
		Иначе
			облСтрока = Макет.ПолучитьОбласть("ОблСтрока");
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ВидДоходов) тогда
				облСтрока.Параметры.ВидДохода = ВыборкаДетальныеЗаписи.ВидДоходов;
			Иначе
				облСтрока.Параметры.ВидДохода = "";
			КонецЕсли;			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СуммаДоходаОборот) тогда
				облСтрока.Параметры.СуммаД = ВыборкаДетальныеЗаписи.СуммаДоходаОборот;
			Иначе
				облСтрока.Параметры.СуммаД = "";
			КонецЕсли;			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СтатьяРасходов) тогда
				облСтрока.Параметры.СтатьяРасхода = ВыборкаДетальныеЗаписи.СтатьяРасходов;
			Иначе
				облСтрока.Параметры.СтатьяРасхода = "";
			КонецЕсли;			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СуммаРасходаОборот) тогда
				облСтрока.Параметры.СуммаР = ВыборкаДетальныеЗаписи.СуммаРасходаОборот;
			Иначе
				облСтрока.Параметры.СуммаР = "";
			КонецЕсли;
		КонецЕсли;
		ТабличныйДокумент.Вывести(облСтрока);
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(облСтрокаПоследняя);

КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	СформироватьОтчетНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМесяцКДате(Команда)
	
	Объект.НачалоПериода = ДобавитьМесяц(Объект.НачалоПериода,1);
	Объект.КонецПериода  = ДобавитьМесяц(Объект.КонецПериода, 1);
	СформироватьПредставлениеДаты();
	СформироватьОтчетНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УбавитьМесяцИзДаты(Команда)
	
	Объект.НачалоПериода = ДобавитьМесяц(Объект.НачалоПериода,-1);
	Объект.КонецПериода  = ДобавитьМесяц(Объект.КонецПериода, -1);
	СформироватьПредставлениеДаты();
	СформироватьОтчетНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьПредставлениеДаты()
	
	ПредставлениеДаты = Формат(Объект.НачалоПериода,"ДФ='MMMM yyyy'" );
	
КонецПроцедуры
